[
  {
    "name": "Maahyar Azad",
    "email": "mhyrinc@gmail.com",
    "message": "test",
    "attachment": {
      "originalName": "GEC Services (1).csv",
      "mimetype": "text/csv",
      "size": 184
    },
    "timestamp": "2025-07-14T05:36:35.364Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "mhyrinc@gmail.com",
    "message": "test",
    "attachment": null,
    "timestamp": "2025-07-14T05:43:00.621Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "maahyarazad@gmail.com",
    "message": "test",
    "attachment": {
      "originalName": "GEC Services (1).csv",
      "mimetype": "text/csv",
      "size": 184
    },
    "timestamp": "2025-07-14T05:49:16.087Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "maahyarazad@gmail.com",
    "message": "test3",
    "attachment": {
      "originalName": "members (3).csv",
      "mimetype": "text/csv",
      "size": 2008
    },
    "timestamp": "2025-07-14T05:50:13.665Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "maahyarazad@gmail.com",
    "message": "Empty File",
    "attachment": null,
    "timestamp": "2025-07-14T05:57:29.823Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "mhyrinc@gmail.com",
    "message": "test file attachment",
    "attachment": {
      "originalName": "299 - Buena Publica FZE - Printings (1).pdf",
      "storedName": "1752472674164-589910304.pdf",
      "mimetype": "application/pdf",
      "size": 271825
    },
    "timestamp": "2025-07-14T05:57:56.421Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "mhyrinc@gmail.com",
    "message": "Hello PalmX",
    "attachment": {
      "originalName": "amazon.ae - Order 406-9656506-4644333.pdf",
      "storedName": "1752472895187-410467356.pdf",
      "mimetype": "application/pdf",
      "size": 76838
    },
    "timestamp": "2025-07-14T06:01:35.188Z"
  },
  {
    "name": "Maahyar Azad",
    "email": "mhyrinc@gmail.com",
    "message": "Steel is a crucial material in materials science due to its versatility and wide range of applications, achieved by alloying iron with carbon and other elements. The properties of steel, such as strength, toughness, and corrosion resistance, are heavily influenced by its composition and microstructure. Understanding the relationship between steel's microstructure, composition, and processing is key to tailoring its properties for specific engineering applications. \r\nKey aspects of steel in material science:\r\nComposition:\r\nSteel is primarily an alloy of iron and carbon, with varying amounts of other elements like manganese, chromium, nickel, etc., added to modify its properties. \r\nMicrostructure:\r\nThe arrangement of atoms within the steel (its crystalline structure) and the presence of different phases (like ferrite, austenite, etc.) significantly impact its mechanical behavior. \r\nProcessing:\r\nTechniques like heat treatment (quenching, tempering) and thermomechanical processing (controlled rolling and cooling) are used to manipulate the microstructure and achieve desired properties. \r\nClassification:\r\nSteels are categorized based on their composition (carbon steel, alloy steel, stainless steel) and their microstructure, which dictates their properties and applications. \r\nApplications:\r\nSteel's strength, durability, and relatively low cost make it a cornerstone material for construction, transportation, infrastructure, tools, and many other industries. \r\nSpecific examples:\r\nCarbon steels:\r\nThese are the most basic type, with varying carbon content influencing strength and hardness. \r\nAlloy steels:\r\nAlloying elements are added to enhance specific properties like strength, corrosion resistance, or high-temperature performance. \r\nStainless steels:\r\nHigh chromium content provides excellent corrosion resistance, making them suitable for harsh environments. \r\nTool steels:\r\nDesigned for high hardness and wear resistance, used in cutting tools and other demanding applications. \r\nIn essence, materials science for steel involves understanding the complex interplay between composition, microstructure, processing, and resulting properties, allowing engineers to design and produce steels tailored to a vast array of applications. ",
    "attachment": {
      "originalName": "159 - German World Club FZCO - Stickers - Proforma Invoice.pdf",
      "storedName": "1752473017152-345024782.pdf",
      "mimetype": "application/pdf",
      "size": 270880
    },
    "timestamp": "2025-07-14T06:03:37.153Z"
  }
]